[
  {
    "jobContent": "To explore the possibility of working together with PTML through our service provider(s) you may apply on the job posted below. \n  Job Purpose:   Area Retail Manager (Retail Sales) is a key position to manage company's business in the assigned territory through effective channel handling. The position is responsible to manage retail of all the products available in the market, and to achieve assigned targets of development and recharge.  \n Job Responsibilities:  Availability and replenishment of Ufone products like cards, load, SIMs, etc. Development (direct/indirect) of existing areas/markets and exploration of new potential markets \n Ensuring data accuracy of retail universe in the system  \n Doing visibility audit of merchandising\n Franchise management, including team development, regular follow ups, target achievement and policy adherence  \n Education (Qualification / Certifications) \n      Bachelor’s degree from a reputable university   Required Experience: 0 to 2 years\n   Skills and Expertise: Good communication skills\n Proficient in Microsoft Office Analytical skills \n Designation Level: Executive   Reporting to: Manager   Employment Type: Outsourced  \n  Location: \n Quetta\n   \n  Employment Type:\n  The position is available with PTML’s service provider HRSG Outsourcing engaged in providing services to PTML for various projects. ",
    "jobDatePosted": 1496817746000,
    "jobLocation": [
      "Pakistan"
    ],
    "jobUrl": "https://www.linkedin.com/jobs/view/324529095",
    "jobTitle": "Area Retail Manager - Quetta",
    "jobProvider": "Ufone",
    "jobProviderLogo": "/AAEAAQAAAAAAAAicAAAAJDE5ZTNlMTA3LWE3NTItNDQwZi05ZDY2LTc5YjU1ZWMyN2ExZQ.png",
    "jobId": "linkedin-324529095",
    "jobSource": "linkedin"
  },
  {
    "jobContent": "Key Responsibilities: \n .  Delivering key KPIs: generating sales, margin, frequency etcetera for defined customer base \n ·Accountable for a Portfolio business plan which focuses clearly on planning, and execution of targeting new and existing customers\n  \n  ·Identifying business potential of the prospective customer and developing a professional relationship through personal visits  \n  ·Following up on new customer activity in order to establish customer needs and to respond to any feedback/criticism/potential  \n  ·Responsible for increasing sales of existing customers  \n  ·Compile sales objectives Gap analysis   \n  ·Organize the follow-up of customer commitments during the visits or per phone \n  ·Scheduling of activity with Customers  \n \n Eligibility ·Master’s/Bachelor’s degree from a reputable institution.  \n  ·Minimum of  2-3 years experience preferably in Sales/Marketing",
    "jobDatePosted": 1496817036000,
    "jobLocation": [
      "Pakistan"
    ],
    "jobUrl": "https://www.linkedin.com/jobs/view/324527637",
    "jobTitle": "Sales Executive: Faisalabad",
    "jobProvider": "METRO/MAKRO Cash and Carry",
    "jobProviderLogo": "/AAEAAQAAAAAAAAo1AAAAJGRkMTRiMzA2LTlmNzEtNGIzNC1iY2M4LWI3Y2YwMmZjNzg2Mw.png",
    "jobId": "linkedin-324527637",
    "jobSource": "linkedin"
  },
  {
    "jobContent": "Key Responsibilities: \n .  Delivering key KPIs: generating sales, margin, frequency etcetera for defined customer base \n ·Accountable for a Portfolio business plan which focuses clearly on planning, and execution of targeting new and existing customers\n  \n  ·Identifying business potential of the prospective customer and developing a professional relationship through personal visits  \n  ·Following up on new customer activity in order to establish customer needs and to respond to any feedback/criticism/potential  \n  ·Responsible for increasing sales of existing customers  \n  ·Compile sales objectives Gap analysis   \n  ·Organize the follow-up of customer commitments during the visits or per phone \n  ·Scheduling of activity with Customers  \n \n Eligibility ·Master’s/Bachelor’s degree from a reputable institution.  \n  ·Minimum of  2-3 years experience preferably in Sales/Marketing",
    "jobDatePosted": 1496816664000,
    "jobLocation": [
      "Pakistan"
    ],
    "jobUrl": "https://www.linkedin.com/jobs/view/324526672",
    "jobTitle": "Sales Executive: LAHORE",
    "jobProvider": "METRO/MAKRO Cash and Carry",
    "jobProviderLogo": "/AAEAAQAAAAAAAAo1AAAAJGRkMTRiMzA2LTlmNzEtNGIzNC1iY2M4LWI3Y2YwMmZjNzg2Mw.png",
    "jobId": "linkedin-324526672",
    "jobSource": "linkedin"
  },
  {
    "jobContent": "Employment Type: Permanent\n\nPosition: Regional HR Manager- South\n\nBase City: Karachi\n\nDepartment: Human Resources\n\nEducation Profile Req: Bachelors in Human Resources Management / MBA in Human Resources\n\n(Preferred)\n\nExperience: 7-8 Years\n\nReporting Line: GM Human Resources\n\nTraveling: Yes, Quarterly within Region (South)\n\nProbation Period: 3 months\n\nPreferred Industries: FMCG\n \n Brief Job Description:\n\nThe incumbent will be leading the HR Team in South region reporting directly into GM Human\n\nResources. Overseeing the operations of HR Function in the South Region including but not\n\nlimited to Recruitment &amp; Selection, Training &amp; Development, Compensation &amp; Benefits, HR\n\nOperations and Special Projects. Interact, partner and resolve issues of all Stakeholders within\n\nthe Organization on a day to day basis. Assisting and advising the GM Human Resources on\n\nvarious HR related matters. Ensuring all critical processes / Key activities such Head Count\n\nPlanning, Performance Management, Succession Planning, Training &amp; Development within the\n\nHR Function is completed/delivered within the stated timelines/deadlines.\n \n Other Requirements:\n\n Young, dynamic, self-motivated and result oriented individual\n\n Should have command on MS Office application\n\n Experience of working on an ERP; SAP preferably\n\n Should possess good interpersonal skills (verbal &amp; written)\n\n Team Player\n\n Strong Analytical Skills\n\n Ability to Change the landscape\n\n Change Management Champion",
    "jobDatePosted": 1496814776000,
    "jobLocation": [
      "Pakistan"
    ],
    "jobUrl": "https://www.linkedin.com/jobs/view/324526100",
    "jobTitle": "Regional HR Manager - South",
    "jobProvider": "Tapal Tea (Pvt.) Ltd.",
    "jobProviderLogo": "/p/1/000/018/130/18b5c53.png",
    "jobId": "linkedin-324526100",
    "jobSource": "linkedin"
  },
  {
    "jobContent": "Position: Assistant Manager Research & Analysis \n Department: Commercial Planning & BS Central \n Location: Central I - Lahore Reporting to: Sr. Manager Commercial Planning & Business Support  Last Date to Apply: June 12, 2017 \n \n Job Responsibilities: \n   Business Analysis: Analysing existing and new business opportunities at the regional level using BI system and improve upon the analytics to enable regional management to take appropriate business decisions. Market Research: Conducting market research at the regional level to gain detailed insight regarding customer’s needs and perceptions thereby enabling management to provide the customer with the ideal product along with its ideal placement. Geo Marketing: Identify areas for network expansion in coordination with regional sales and engineering teams. Locking and monitoring the targets for coverage requests. Ensuring effective network utilization by continuously focusing on and pushing the sales team to enhance customers and revenue from low revenue sites. Channel, Network, Visibility & Promotion Mapping: Ensuring channel presence in areas which are being covered through new rollout. Identifying areas where channel is weak and ensuring adequate channel presence to ensure maximum resource utilization of channel as well as network. Also mapping visibility and promotional activities against our network and channel presence. Planning the utilization of all four resources in the most efficient manner Segment development in region: Be responsible to design implementation plan for nationwide segments and design local segment strategy and plan, ensuring right product offering to the right segment of subscribers via right channel, ensuring successful segment development in region. Target Management: Assisting the manager in monitoring regional targets. Keeping a close eye on that targets, identifying reasons for variance if any and suggesting corrective actions Reporting: Compiling daily, weekly and monthly reporting.    Eligibility Criteria (Education, Knowledge, Experience and Skills): \n Qualification:  MBA/CA/ACMA. Certification/Diploma in Commercial/Financial Analysis will be preferred. \n  Experience:  Minimum 05 years of experience in Marketing & Sales Environment  \n Skills – Job Specific:   Excellent Analytical Skills| Project Management| Process oriented and well organized",
    "jobDatePosted": 1496813502000,
    "jobLocation": [
      "IslamabadGpo",
      "FederalCapial&AJK",
      "Pakistan"
    ],
    "jobUrl": "https://www.linkedin.com/jobs/view/362489997",
    "jobTitle": "Assistant Manager Research & Analysis",
    "jobProvider": "Zong CMPak Ltd",
    "jobProviderLogo": "/AAEAAQAAAAAAAAmAAAAAJDg5OGRjYWNhLTBjYmYtNDhmZi04OTk1LTdhY2VmOTkyOTA4Zg.png",
    "jobId": "linkedin-362489997",
    "jobSource": "linkedin"
  },
  {
    "jobContent": "Vacancy Description\nRight to work in Pakistan/ Salary : Pay band 7, Contract :One year fix term contract, Region: South Asia, Country :Pakistan , Location :Lahore, Department :English & Exams, Job Category :Exams\nDetails\nThe British Council Pakistan is recruiting for Head of Transformation based in Lahore\nPURPOSE OF JOB\nThe role will support the Exams Management and Operational teams across the country with the preparation and implementation of new global processes and systems across the country.\nThis role will work closely with specialists who are responsible for delivering people and organisational change.\nCONTEXT AND ENVIRONMENT\nThe British Council’s global Examinations Services target is to deliver eight million exams a year globally by 2020, generating income of £500m. To enable this we are running a number of global Exams Transformation projects and programmes to make sure we have the right processes, systems and organisation structure in place to deliver our targets. For the benefits of the programmes to be realised they must be owned in country and that’s where you’ll come in. As the country operational change manager you’ll be the link between your country, the regional team and the programmes, ensuring everything is in place to manage the change effectively and deliver the benefits.\nExams Transformation Includes The Following Projects And Programmes\nGNOME (Global New Operating Model for Exams): The Exams business has grown organically over time. Exams centres have created many different local processes, have started to develop local technology solutions, and business growth and risks have become more complex to manage.\nThrough GNOME, Exams will move away from local approaches and adopt a standard operating model, a standard set of processes and standard systems. This will enable the business to continue to grow and compete in a changing market. Delivery will be focused on our 23 largest markets, to ensure we gain the most benefit. 2017/18 will bring a large amount of change to our Exams organisation, with releases expected in quarter 2 and quarter 4. We’ll deliver enhancements to our Back Office Scheduling System (BOSS), introducing some new tools for venue staff and automated payments. Later in the year, we’ll release ORS2, our new online registration system for customers. Alongside this will ensure our updated processes and operating model are adopted in countries.\nOSM (On Screen Marking) delivers on-screen marking capability for IELTS and move marking into hubs. This will help lift capacity constraints related to examiners in country.\nCBT (Computer Based Testing) delivers the capability for the British Council to deliver Distribution exams via computer. This enables us to win new contracts or retain existing business with distribution boards such as ACCA.\nComputer Delivered IELTS fulfils a UKVI contractual requirement that some Secure English Language IELTS tests are delivered via computer. The volumes are very limited\nOther Important Features And Requirements Of The Job\nThe post holder will be required to work during unsocial hours.\nIf you are interested to apply, for further information please see the documents below:\nClosing Date\nUK time: 23:59, 19-June-2017\nPak time: 3:59 am 20-June-2017\nThe British Council is committed to a policy of equal opportunity. British Council is committed to safeguarding and promoting the welfare of children and young people and expects all of its partners to share this commitment. In line with the British Council’s Child Protection policy, any appointment is contingent on thorough checks. In the UK, and in other countries where appropriate systems exist, these include criminal records checks.\nPay Band: Pay Band 7Region: South Asia",
    "jobDatePosted": 1496813059000,
    "jobLocation": [
      "Lahore",
      "PK"
    ],
    "jobUrl": "https://www.linkedin.com/jobs/view/362484549",
    "jobTitle": "Head of Transformation-Lahore-PB7-(LHE/128/1718)",
    "jobProvider": "British Council",
    "jobProviderLogo": "/AAEAAQAAAAAAAAviAAAAJGY4YWYzNmU4LWE4MGYtNGRlZC1hNTQxLTE3NWY4NjA4YzM0ZA.png",
    "jobId": "linkedin-362484549",
    "jobSource": "linkedin"
  },
  {
    "jobContent": "Vacancy Description\nRight to work in Pakistan/ Salary : Pay band 7, Contract :One year fix term contract, Region: South Asia, Country :Pakistan , Location :Lahore, Department :English & Exams, Job Category :Exams\nDetails\nThe British Council Pakistan is recruiting for Customer Services in Lahore\nPURPOSE OF JOB\nThe post holder will be responsible for managing a data led professional Customer Services operation for Pakistan, which will include all channels of service including management of Venue staff management operation. He / She would ensure that different teams engaged in the process deliver a seamless, consistent and high quality customer experience to the British Council customers.\nThis role will need to implement a holistic customer services strategy for Pakistan which focuses not only on external facing diverse audiences but also on managing relationships with key stakeholders\nCONTEXT AND ENVIRONMENT\nThe British Council creates international opportunities for the people of the UK , other countries and builds trust between them worldwide.\nAs the United Kingdom`s international organisation for cultural relations and educational opportunities , the British Council works with public and private sector organizations across the world to build mutually – beneficial relationships .\nThe Pakistan exams operation is one of the largest in the British Council network and a growing one, effective customer services are key to the continued growth of the exam operation. Customer services ensure that customers employ less effort in accessing our services and thus have a positive experience from all these areas of activity.\nOther Important Features And Requirements Of The Job\nThe post holder will be required to work during unsocial hours.\nIf you are interested to apply, for further information please see the documents below:\nClosing Date\nUK time: 23:59, 19-June-2017\nPak time: 3:59 am 20-June-2017\nThe British Council is committed to a policy of equal opportunity. British Council is committed to safeguarding and promoting the welfare of children and young people and expects all of its partners to share this commitment. In line with the British Council’s Child Protection policy, any appointment is contingent on thorough checks. In the UK, and in other countries where appropriate systems exist, these include criminal records checks.\nPay Band: Pay Band 7Region: South Asia",
    "jobDatePosted": 1496813059000,
    "jobLocation": [
      "Lahore",
      "PK"
    ],
    "jobUrl": "https://www.linkedin.com/jobs/view/362486214",
    "jobTitle": "Head – Customer Services-Lahore-PB7-(LHE/127/1718)",
    "jobProvider": "British Council",
    "jobProviderLogo": "/AAEAAQAAAAAAAAviAAAAJGY4YWYzNmU4LWE4MGYtNGRlZC1hNTQxLTE3NWY4NjA4YzM0ZA.png",
    "jobId": "linkedin-362486214",
    "jobSource": "linkedin"
  },
  {
    "jobContent": "Position: Expert IT (DBA) \n Department: IT\n Location: HQ - Islamabad Reporting to: Senior Manager IT (Infrastructure)  Last Date to Apply: June 10, 2017 \n \n Job Responsibilities: \n \n  Providing and ensuring 24x7 First and Second line of support for operations for achieving the agreed Availability and Performance of Enterprise Databases and Enterprise Backup Solution and Oracle EBS suite (APPSDBA) Manage production incidents to resolution, ensuring timely engagement, escalation and effective communication to internal stakeholders and vendor partners. Reporting on process improvements, team performance and agreed service levels. Vendor management and responsible for support in Vendor Contracts and Renewals. Devising and planning annual goals for the team and motivating and developing the team. Devising Disaster Recovery Strategy and Business continuity Model and formalizing processes governing Change, Deployment & Incident Management. Project Management. Defining and creating schedules, statements of work, directing, and coordinating projects by establishing a work plan, arranging staffing, assigning duties, producing reports, and ensuring the progression and completion of the project. Working with the management team, the position also contributes to the development and implementation of organizational strategies, policies and practices. Contribute to short and long-term organizational planning and strategy as a member of the management team. Drive initiatives in the management team and organizationally that contribute to long-term operational excellence. Provide leadership, guidance and oversight for the team function. This includes motivating and building team, ensuring success through individual goal setting and performance management, and being a point of escalation for business and technical issues related to Database Availability and Data Protection Domain. Works with IT leadership to define and implement standards and guidelines in order to ensure the effective execution of ongoing support and delivery of high-quality, cost-effective, secure and reliable services. Responsible for Operations, Planning & Expansion for Infrastructure Services (Databases & Data protection to support IT). Functional and Administrative Lead for a team of database specialists providing Database Administration and Data Protection support to IT.    Eligibility Criteria (Education, Knowledge, Experience and Skills): \n Qualification:  4 years Bachelor degree, preferably in Information Technology and/or Telecommunications Experienced and certified DBA Training in PMP\nTraining in ITIL Foundation\n \n  Experience:  Preferably 4 to 5 year experience in Leadership Role and experience in Managing Teams Extensive experience in running & managing Operations preferably in Service Industry Experience in Telco Industry Exposure to Customer Services Experience in Managing Projects from Design to Implementation 8 to 10 year experience in Database Administration and strategy 2 to 3 year Experience in Data Protection Administration and strategy Exposure and experience in managing Oracle EBS Suite from APPSDBA perspective  \n Skills – Job Specific:  Oracle Database Administration | Microsoft SQL Server Administration | Cluster Technologies (RAC, Veritas, Microsoft Cluster) | Project Management Principles | ITIL standard best practices | Unix Flavor OS Administration | Shell Scripting | PL/SQL Scripting | Enterprise Storage and Server Management | Data Protection Solution Administration",
    "jobDatePosted": 1496812457000,
    "jobLocation": [
      "IslamabadGpo",
      "FederalCapial&AJK",
      "Pakistan"
    ],
    "jobUrl": "https://www.linkedin.com/jobs/view/362480273",
    "jobTitle": "Expert IT (DBA)",
    "jobProvider": "Zong CMPak Ltd",
    "jobProviderLogo": "/AAEAAQAAAAAAAAmAAAAAJDg5OGRjYWNhLTBjYmYtNDhmZi04OTk1LTdhY2VmOTkyOTA4Zg.png",
    "jobId": "linkedin-362480273",
    "jobSource": "linkedin"
  },
  {
    "jobContent": "Medical Affairs\nKarachi\nDo you have a medical or science degree and willing to begin your career in the  Medical Affairs department  ? Join Novo Nordisk Pakistan for a  life-changing career .\nAbout The Department\nOur head office is located in Karachi - with almost 230 employees all across Pakistan, we strive towards changing lives of people with diabetes. Our main objective is to ensure we have the best organization and right people in place to ensure continued growth in the affiliate. Our role is to support the affiliate in close collaboration with Marketing, Sales and Market Access teams.\n The position \nAs a person, you shall strive towards working with operational tasks. You bring a can-do spirit and responsibility to your work – even under pressure. You are a dedicated team player, but you also enjoy working independently and finding new solutions to the challenges you meet. You are a skilled communicator who is comfortable speaking and writing English.\nYou are someone who can build relationships with key stakeholders and communicate the clinical outcomes and benefits of Novo Nordisk products. Demonstrate mastery of disease state and product knowledge.\nWithin Medical department, this position functions as a scientific liaison between Novo Nordisk and key opinion leaders / HCPs to nurture scientific exchange. This position also supports office medical team in the execution of the medical programs and activities. S/he provides product and scientific field support to internal and external stakeholders by using academic credentials and scientific expertise.\nThe position reports to Regional Medical Advisor Manager.\nQualifications\nYou are required to have a degree in science Pharm-D or MBBS from a highly reputable university. For external candidates minimum 1 year of experience in relevant field is required. For internal candidates preferably 2-3 years of Novo Nordisk sales experience with appropriate qualification. High mobility in the region is required - you will be required to travel 30-40% of your job. Strong interpersonal & communication skill; (both written and spoken in English) is also required.\n Working at Novo Nordisk \nNovo Nordisk is a global company offering worldwide opportunities to employees. From research and development, through to manufacturing, marketing, medical and sales, the skills and backgrounds that our employees bring to work are diverse.\nOur comprehensive value chain offers the potential for you to experience areas of the business outside your initial skill set, so developing your career through in-house as well as external training.\nOur company framework, The Novo Nordisk Way , supports our culture of innovation and responsibility. It ensures the long-term growth and welfare of our company and helps us find the right balance between compassion and competitiveness.\nWhat Do We Offer\nAt Novo Nordisk, we use our skills, dedication and ambition to help people with diabetes. We offer the chance to be part of a truly global work place, where passion and engagement are met with opportunities for professional and personal development.\n Contact \nIf you are interested in joining our team and you are qualified for the challenge please submit your CV online through the career site.\n Deadline \nPlease apply latest by 12 th June 2017.\nInternal candidates are required to inform their line manager before applying",
    "jobDatePosted": 1496810944000,
    "jobLocation": [
      "Karachi",
      "PK"
    ],
    "jobUrl": "https://www.linkedin.com/jobs/view/305692572",
    "jobTitle": "Regional Medical Advisor",
    "jobProvider": "Novo Nordisk",
    "jobProviderLogo": "/AAEAAQAAAAAAAAIAAAAAJDgzNDcyMzY1LWQ0ZTMtNDc4OS04ZjhhLWQ0YzVlOTE5YTAzOQ.png",
    "jobId": "linkedin-305692572",
    "jobSource": "linkedin"
  },
  {
    "jobContent": "Reporting to: Manager, Digital Products Job Group: 2A/ 2B  Location: Islamabad  Division: Digital   Department: Digital Products  \n      Why should you join Telenor?  At Telenor Pakistan, we give you the opportunity to become a skilled professional in your chosen field of interest. Being rated as the top employer of the country, we enable you to realize your dreams in an environment of diversity and openness to new mindsets.     The Digital Products team is in charge of delivering innovative digital experiences to our customers and we here do everything from creating new apps and platforms to partnering with relevant digital partners. We are looking to strengthen our team by hiring a technology-focussed professional that brings in a high level of creative energy and business acumen.     Your passion for consumer products must be so strong that there should be rarely an app that you haven’t tried and analyzed. The Productivity vertical includes any innovative solutions that make our customer’s lives easier. They could save users time to perform a task or remove complexity from tasks.  Examples of productivity solutions include Google Docs, Dropbox, Shazam, Smart Voice Recorder, Slack, Voice Search, Zapier, Google Maps, Unit Converter, etc.  \n    Goals  Own products’ roadmap, objectives and KPIs\n Identify creative marketing and distribution opportunities for products\n Explore, identify and execute on strategic growth opportunities\n Support the Digital Products team to achieve revenue, penetration and usage enhancement by bringing in the right international & local partners and developing products/services accordingly for target segment(s) and creating differentiation\n   \n     Your Typical day at work  Devise and execute strategies to grow user base, improve retention and increase engagement of digital products\n Develop ways to quickly test digital products quantitatively (e.g. A/B testing) and qualitatively (e.g. user testing)\n Carry out usability studies, research and user analysis and integrate them into product improvements\n Managing and working with cross-functional teams to get projects executed properly (e.g. with Marketing, Segments, Sales and Distribution, Pricing, Products, Business Intelligence, Technology)\n Prepare business models/cases for new products, offers  and potential partnerships\n Manage partnerships with vendors and leverage Telenor’s scale/network to come up with interesting propositions\n Define and analyze metrics that inform the success of products\n Develop product forecasts for target & growth monitoring\n  \n    Eligibility Criteria     Education:  Bachelor’s degree or an MBA from a reputed university  Experience:  At least 3-4 years managing consumer and mobile products\n Digital marketing experience (including social media) and expertise in Product Marketing\n Experience with Google Adwords, Google Analytics, MixPanel, Localytics\n        Functional Skills / Knowledge Areas  Exceptional communication and presentation skills\n Exceptional organizational and analytical skills\n Strong Product Marketing knowledge\n Knowledge of data analysis tools and techniques\n   ",
    "jobDatePosted": 1496786017000,
    "jobLocation": [
      "IslamabadGpo",
      "FederalCapial&AJK",
      "Pakistan"
    ],
    "jobUrl": "https://www.linkedin.com/jobs/view/362122723",
    "jobTitle": "Digital Products Specialist",
    "jobProvider": "Telenor",
    "jobProviderLogo": "/AAEAAQAAAAAAAAb5AAAAJGFiMTkyMjEyLTc5ZWItNGE5MC1iMDM1LTY5YTM4YzVmYTdhYw.png",
    "jobId": "linkedin-362122723",
    "jobSource": "linkedin"
  },
  {
    "jobContent": "Reporting to: Head of IoT  Job Group: 4A/B  Location: Islamabad  Division: Digital  Department: IoT\n  \n   Why should you join Telenor?     At Telenor Pakistan, we give you the opportunity to become a skilled professional in your chosen field of interest. Being rated as the top employer of the country, we enable you to realize your dreams in an environment of diversity and openness to new mindsets.  Internet is a key focus area for Telenor Pakistan and we are strongly comitted to  Digital ambitions and IoT is one of the key adjacent business verticals that presents a strong opportunity for business growth, this means that the work you do as Manager IoT Verticals will carry special significance and exposure.  \n \n Goals     This is a completely new business category and someone with an entrepreneurial mind-set is needed to plan, develop and coordinate the execution of IoT strategy in the selected verticals to delivery tangible results.\n GTM planning and execution in mobility and energy category and developing the IoT ecosystem are they key deliverables of this position.\n Be the custodian of customer experience and Insight on IoT Apps & Services, managing customer journey and life-cycle effectively.\n Hacking growth in key IoT verticals facilitating Telenor Pakistan’s play as a SAAS provider.\n Manage vertical / category leads to deliver on key KPIs and ensure that we develop the right tracking mechanisms to monitor progress.\n Support the Channel & Partnerships team to close on business development leads and manage the products roadmap.\n     Your Typical day at work \n  Focus on on-going IoT deployment activities and ensuring that all touch-points are aligned for providing a spring-board for launch.\n Strategic planning of future roadmap including working with Commercial, Finance and Technology teams for developing consensus on shared business objectives, support processes, roadmap plans and feasibility.\n Contribute to the Software product and the custodian of customer journey and insights.\n Interacting with PGA and Regulator along with stakeholders like ICT fund to help foster an ecosystem conducive to IoT.\n Understand, and develop relevant propositions specific to IoT, in order to drive relevance and need for services.\n Work closely with relevant teams to come up with product solid proposition and GTM plan for various initiatives.\n  \n   Eligibility Criteria \n  Education:  Masters/Bachelor in Business Administration or B.Engineering with Commercial Exposure.  Work experience:  Overall 8+ years and 3+ years of experience in relevant feilds (Digital Businesses, Stratups, Business Consulting, IoT).  \n   Potential Career Path:    Internet of Things is the next frontier for the industry and Telenor Pakistan is the best positioned to reach its goals.  Being a part of the Internet of Things team the candidate will gain:  Strong understanding of the digital industry and the opportunities and challenges in the local market.\n Understanding of the IoT value-chain & ecosystem with exposure to devices, technology and Software.",
    "jobDatePosted": 1496784620000,
    "jobLocation": [
      "IslamabadGpo",
      "FederalCapial&AJK",
      "Pakistan"
    ],
    "jobUrl": "https://www.linkedin.com/jobs/view/362102689",
    "jobTitle": "Manager IoT Verticals",
    "jobProvider": "Telenor",
    "jobProviderLogo": "/AAEAAQAAAAAAAAb5AAAAJGFiMTkyMjEyLTc5ZWItNGE5MC1iMDM1LTY5YTM4YzVmYTdhYw.png",
    "jobId": "linkedin-362102689",
    "jobSource": "linkedin"
  },
  {
    "jobContent": "Reporting to: Manager Mobile Advertising  Job Group: Contractual  Location: Islamabad  Division: Digital   Department:  Mobile Advertising     \n Why should you join Telenor?     At Telenor Pakistan, we give you the opportunity to become a skilled professional in your chosen field of interest. Being rated as the top employer of the country, we enable you to realize your dreams in an environment of diversity and openness to new mindsets.  \n The Mobile Advertising team operates like a startup within Telenor with the ambition of become a standalone organization in the future. This gives rise to tremendous opportunities for growth and learning. If you like to wear multiple hats, put up your hand to be counted and get stuff done at the end of the day then this is the role for you in an exciting set up. Get the best of both worlds, a fast-paced startup culture environment with the stability and culture of Telenor  This position will be responsible for providing relevant reports to answer various business questions faced by the organization. Candidate will work in close coordination with Business Units to address their problems and build an understanding of the business at a level of detail that enables them to identify and address critical issues.  \n Key candidate for this role should have proven track record of BI techniques and have experience of media modelling and optimization using analytics dashboards.     \n Goals     Customer profiling, segmentation and validation to identify target audiences for different partners and products under Mobile Advertisement portfolio.\n Benchmarking and evaluation of executed or currently running media campaigns to provide consumer insights based on qualitative and quantitative analysis.\n Analysis of running apps/products to measure user engagement, retention and growth across a variety of channels\n Optimizing marketing plans to maximize growth potential based on data analytics.\n Interfacing with the product team so that they follow a “lean” data-driven approach to product development\n     \n    Your Typical day at work     Work with the Mobile Advertising team to generate reports on different criteria to conduct marketing campaigns for various partners and products.\n Leverage BI technologies to facilitate and enable business users\n Market planning for various ad campaigns to drive product growth.\n Post Campaign analysis to provide insights on conversions.\n Work with our own software development and product teams to build better products powered by real usage data & analytics\n     \n Potential Career Path   Full time roles in Mobile Advertising, Business Intelligence or other related areas. Our team is like a startup within Telenor and even though this is a contractual position, there are a lot of possibilities if our work takes off  \n \n    Eligibility Criteria     Education:  Minimum Bachelors, Masters preferred (From a recognized university) in Computer Science  Work experience/Skills  Minimum 2-3 years of relevant experience in areas mentioned below\n Excellent understanding BI and DWH systems as well as ETL\n Excellent understanding of Business Intelligence concepts\n Perform quantitative analysis and reach sound conclusions. High level of proficiency with SQL and Excel (pivot tables) is essential.\n Hands-on experience with Business Objects or similar applications is essential.\n Data exploration via BI tools and SQL to collect key consumer insights for analysis according to business needs.\n Proficiency with scripting for data binding purposes to serve reports is required.\n Experience in Performance Tuning, Query Optimization, using SQL Profiler and other related monitoring and troubleshooting tools is a plus.\n Hands-on experience of working with analytics dashboards like Google Analytics, Mixpanel, Kissmetrics etc. is a plus.\n Knowledge of Advanced Analytics and Big Data is nice to have.\n  \n Functional Skills / Knowledge Areas     Innovative, proactive and business focused\n Self-driven, flexible and ability to work well in pressure situations\n Analytical thinking as well as ability to work independently as well as part of a team.\n Excellent interpersonal communication skills (Listening, Speaking, Reading & Writing)\n Influencing, Convincing and Negotiation Skills.",
    "jobDatePosted": 1496783293000,
    "jobLocation": [
      "IslamabadGpo",
      "FederalCapial&AJK",
      "Pakistan"
    ],
    "jobUrl": "https://www.linkedin.com/jobs/view/362094356",
    "jobTitle": "BI Data Analysis Executive (Digital)",
    "jobProvider": "Telenor",
    "jobProviderLogo": "/AAEAAQAAAAAAAAb5AAAAJGFiMTkyMjEyLTc5ZWItNGE5MC1iMDM1LTY5YTM4YzVmYTdhYw.png",
    "jobId": "linkedin-362094356",
    "jobSource": "linkedin"
  },
  {
    "jobContent": "Reporting to: Head of Mobile Advertising  Job Type: Contractual  Location: Islamabad  Division:  Digital  Department:  Mobile Advertising     \n Why should you join Telenor  At Telenor Pakistan, we give you the opportunity to become a skilled professional in your chosen field of interest. Being rated as the top employer of the country, we enable you to realize your dreams in an environment of diversity and openness to new mindsets.     The Mobile Advertising team operates like a startup within Telenor with the ambition of become a standalone organization in the future. This gives rise to tremendous opportunities for growth and learning.     If you like to wear multiple hats, put up your hand and be counted and get stuff done at the end of the day then this is the role for you in an exciting set up. Get the best of both worlds, a fast-paced startup culture environment with the stability and culture of Telenor     \n Goals  To execute the vision of the Mobile Advertising team by monetising Telenor owned and operated mobile and web applications in a true startup-like fashion.     We are looking for a Head of Business Development who is confident, passionate about quality and knows what end-to-end ownership means. You will be working with leading advertisers, brands and agencies in Pakistan to generate sales. Ultimately you will be measured on closing ad sales and retaining key advertisers on a long-term basis     In this role you should be effective at communicating with the above mentioned stakeholders and liaising between them and internal team members such as ad ops, BI etc so that the true power of Telenor’s data can be unleashed in the digital advertising realm. You are expected to protect customer privacy as per applicable laws and Telenor policies but at the same time deliver value to advertisers so that they spend more advertising $ with us. You will in effect play a key role in making Telenor become the premier data-drive media agency in Pakistan        Your Typical day at work  Understanding the vision of the mAdv adjacent business and translate it into a business development role\n Build pipeline of leads and develop effective sales channels\n Convert leads into actionable sales\n Maintain strong 1-1 relationships with key stakeholders at brands and agencies\n Travel to meet external partners such as advertisers, publishers and technical service providers\n Explore and develop advertising related opportunities at the cluster or region level (Bangladesh, Myanmar, Middle East)  \n    Eligibility Criteria     Education:  Minimum Bachelors, Masters preferred (From a recognized university) in Business, Sciences or other relevant area.     Work experience/Skills\n \n  Solid experience in making pitches to top brands with a track records of closing large deals\n Managing media spend with a solid understanding of media planning across digital and traditional media like TV, print, radio OOH etc\n Experience with building and  managing a team and getting the most out of them when it comes to digital ad campaigns\n Proven experience running data-driven ROI based digital campaigns\n Hands on experience with top digital platform likes Google, FB, Twitter etc\n        Functional Skills / Knowledge Areas     Innovative, proactive and customer focused with a attention to detail\n Demonstrated ability to close deals and retain customers\n Work well in a startup environment and pressure situations\n Self-driven and flexible\n Open to traveling on short notice to meet with clients\n Sharp analytical capabilities that make the best use of rich data\n Analytical thinking as well as ability to work independently as well as part of a team.\n Excellent interpersonal communication skills (Listening, Speaking, Reading & Writing) in (English/Urdu)",
    "jobDatePosted": 1496782481000,
    "jobLocation": [
      "IslamabadGpo",
      "FederalCapial&AJK",
      "Pakistan"
    ],
    "jobUrl": "https://www.linkedin.com/jobs/view/362087219",
    "jobTitle": "Head of Business Development (Digital)",
    "jobProvider": "Telenor",
    "jobProviderLogo": "/AAEAAQAAAAAAAAb5AAAAJGFiMTkyMjEyLTc5ZWItNGE5MC1iMDM1LTY5YTM4YzVmYTdhYw.png",
    "jobId": "linkedin-362087219",
    "jobSource": "linkedin"
  },
  {
    "jobContent": "We are looking for Recruiters/Business Development professionals  to work in the Night Shift     Are you seeking an opportunity to work hard and have fun in a fast paced dynamic industry? If you are confident, possess excellent communication skill and like working with people and being able to offer them rewarding opportunities, then this opportunity could be for you.     Recruitment Consultant Job Description     Headhunting - identifying and approaching suitable candidates;  Completing a search of the candidate database to find the right person for the employers vacancy;  Receiving and reviewing applications, managing interviews and short-listing candidates;  Requesting references and checking the suitability of applicants before submitting their details to the employer;  Briefing the candidate about the responsibilities, salary and benefits of the job in question;  Preparing CVs and correspondence to forward to clients in respect of suitable applicants;  Organizing interviews for candidate as requested by the client;  Informing candidates about the results of their interviews;  Negotiating pay and salary rates and finalizing arrangements between client and candidates;  Offering advice to both clients and candidates on pay rates, training and career progression;  Reviewing recruitment policies to ensure effectiveness of selection techniques and recruitment programs  Requirements     Excellent interpersonal and communication  Excellent spoken English, (American accent preferred)  Attention to detail, well organized, good problem solving skills  Ability to work independently and set own priorities  Proficient computer skills  Skills     Internet and Microsoft Applications  Computer Science degree preferred, will consider other related degrees as well  This individual should have the ability to interact with candidates as well as clients.  Must be willing to constantly educate themselves on cutting edge technology and the ability to assimilate new concepts quickly as technology continues to change at a rapid pace  Call center experience highly preferred   ",
    "jobDatePosted": 1496763018000,
    "jobLocation": [
      "Islamabad",
      "NorthernPunajbRawalpindi",
      "Pakistan"
    ],
    "jobUrl": "https://www.linkedin.com/jobs/view/305683572",
    "jobTitle": "Recruiters/Business Development",
    "jobProvider": "Virtelligence",
    "jobProviderLogo": "/AAEAAQAAAAAAAAfOAAAAJDdlOGUyMTFhLTkwZjYtNDYwZS1iZTE3LWM3NmEwZTA0MDc4ZQ.png",
    "jobId": "linkedin-305683572",
    "jobSource": "linkedin"
  },
  {
    "jobContent": "Description\nMondelēz International LLC is a whole new company that has been reimagined with a single focus in mind: create delicious moments of joy by sharing the world’s favorite brands. Launched on Oct. 1, 2012, and employing around 100,000 people around the world, Mondelēz International comprises the global snacking and food brands of the former Kraft Foods Inc. While Mondelēz International LLC is new, our brands are as diverse and rich with heritage as the 170 countries in which our products are marketed. As the world’s pre-eminent maker of snacks, Mondelēz International LLC has leading shares in every category and every region of the world in which it competes. The company holds the No. 1 position globally in Biscuits, Chocolate, Candy and Powdered Beverages as well as the No. 2 position in Gum. Mondelēz International LLC portfolio includes several billion-dollar brands such as Nabisco, Oreo and LU biscuits, Cadbury and Milka chocolate, Tang powdered beverages and Trident gums. Mondelēz International LLC has annual revenue of approximately $35 billion and operations in more than 80 countries. For more information, please visit: http://www.mondelezinternational.com/ andwww.facebook.com/mondelezinternational\nDrive sales and distribution for the company products and manage his allocated territory and the customer Responsible to deliver sales, distribution and display targets. Implement brands, promotion and other plans in the territory Effective coverage of all routes and random checking of retail outlets Monitor distributor loop (inventory management as per terms), Distribution of products and on-job training of distributor’s staff. Ensure coolers, POS, merchandise and other company resources are effectively utilized in the territory\nQualifications\n Knowledge including: education, qualifications and training  Bachelor’s degree in any field Skills  Highly customer focused.  Negotiating & listening skills  Excellent verbal and written communication skills in Urdu and any regional language  Excellent at numeric and a good sense of curtailing costs Experience  Minimum 3 years with a good record of achieving targets history in a similar assignment within the FMCG or food industry.  Should have a proven track record of meeting deadlines and targets\nPrimary Location\nAMEA-PK-Sind-Nawabshah\nJob\nField Sales\nSchedule\nPart-time",
    "jobDatePosted": 1496746822000,
    "jobLocation": [
      "Nawābshāh",
      "PK"
    ],
    "jobUrl": "https://www.linkedin.com/jobs/view/361846339",
    "jobTitle": "Territory Sales officer(Nawabshah)",
    "jobProvider": "Mondelēz International",
    "jobProviderLogo": "/p/2/005/015/1b3/00148b0.png",
    "jobId": "linkedin-361846339",
    "jobSource": "linkedin"
  },
  {
    "jobContent": "Minimum 4-5 years agency experience is a must\n Position is based in Lahore, Pakistan\n \n Job Description\n Understand the design concept and client brief\n Translate the brief into designs\n Lead and manage a team of designers giving design direction\n Out of box thinking in terms of creating new designs\n Excellent command of design tools including Photoshop, Illustrator etc.\n Experience of working on video editing tools is a definite plus\n Digital agency experience will be preferred",
    "jobDatePosted": 1496743197000,
    "jobLocation": [
      "Lahore",
      "Pakistan"
    ],
    "jobUrl": "https://www.linkedin.com/jobs/view/361827858",
    "jobTitle": "Design Lead - Lahore",
    "jobProvider": "Hashtag Tribe",
    "jobProviderLogo": "/AAEAAQAAAAAAAAWQAAAAJGVlZjFjNjhhLWZiYjgtNDRjYi04NWM4LWMwYTkzMWU0NTQ1ZQ.png",
    "jobId": "linkedin-361827858",
    "jobSource": "linkedin"
  },
  {
    "jobContent": "Reports To\nMaintenance Manager Summary:Reporting / Communicating Planning / Scheduling Executing / Implementing Monitoring / Analyzing Developing & Lead the Department Keeping spare parts and consumables with min- max system Responsible for maximum Plant and Equipment’s availability Performing duties as per requirements. Either 5/2, 14 / 14 or 28/28 Essential Duties & Responsibilities: Plan, Schedule, Supervise, record and perform the Plant Mechanical (static & rotary) maintenance activities, whenever required cover higher position responsibilities. Responsible to be well aware and implementation of Company guide to ethical Business conduct PRIDE Responsible to be well aware and implementation of emergency plan, Company HSE policy and his role & PTW (permit to work) system. Ensures compliance of international standards, engineering practices, quality procedures and OEM instructions. Responsible for maximum plant availability, equipment’s reliability, cost effective maintenance, inventory transactions, Accpac data feedings, Monthly reports, maintenance schedule, duty roster and act as a bridge between management and work force. Responsible for all team members to be well aware of all plant equipment, Instrument, skid and plant facility Responsible for Recording, marinating and updating of the running machines parameters on reading sheets with proper intervals, daily mechanical activity reports in hard copies as well as in soft copies too. Responsible for planning, scheduling and execution of all Preventive/schedule, Predictive and corrective maintenance as per OEM instructions and procedures. Responsible for monitoring, Analyzing and finds correct reason of machine failures/tripping through equipment history, fault history & OEM instructions Responsible for monitoring closely abnormal behaviors & sounds of running machines and take necessary corrective actions. Responsible for rebuild & repair all item in workshop with high standard craftsman ship. Responsible for enhancing the skills of mechanical crew through discussion, debates, presentations and training.\n",
    "jobDatePosted": 1496742364000,
    "jobLocation": [
      "Gilgit",
      "PK"
    ],
    "jobUrl": "https://www.linkedin.com/jobs/view/324505229",
    "jobTitle": "Mechanical Supervisor",
    "jobProvider": "Exterran",
    "jobProviderLogo": "/p/5/000/1da/10f/1134604.png",
    "jobId": "linkedin-324505229",
    "jobSource": "linkedin"
  },
  {
    "jobContent": "Basic Qualifications\n Diploma of Associate Engineering (D.A.E.) with 1-3 years of relevant work experience Should have knowledge in GMP guidelines, QMS requirements and its implementation Good level of English in terms of speaking, writing and reading\nPreferred Qualifications\n Bachelor Engineering in Industrial, Manufacturing, Mechanical or equivalent from a recognized institution Good knowledge of EHS\nDetails\nThe purpose of this job is to ensure the smooth and continuous operation of Non Lactam manufacturing machines as Compression, coating, Bosch sterile filling machine, autoclaves, compounding system so the products are delivered and supplied in full and on time to the patients at the end of our supply chain.To operate the production machines ensuring the required output and complying with applicable cGMP, EHS and Regulatory standards\nKey Responsibilities\n Keep the assigned machine in excellent working condition to attain the required output expected from the respective machine.\nEnsure that the agreed preventive maintenance schedule is followed\n Resolve day to day trouble shooting and immediately inform the Engineering (raise work order) if the situation is not under control. Ensure that all the spare parts for the machine are available and stored properly.\nSuggest and implement measures to improve the machine efficiency\n Ensure the GMP (at all stations of Tablets Bottle filling line, IPC etc) and EHS (Zero access, LOTO etc) compliance during operation. Operate the machine in cost effective way ensuring right first time operation, minimizing changeovers and avoiding wastages. Maintain machine manuals and ensure the revision of SOP’s related to machine operations. Develop alternate operator for business continuity. Ensure that IPC, equipment and the gadgets related to the respective machine are calibrated. Keep up-to-date production, downtime, changeover, preventive maintenance and other records on daily basis. Identify, suggest and implement Operational Excellence (OE) projects after approval of the management. Keep the manufacturing machines in excellent working condition to attain the required output expected from the respective machine. In line with GPS, maintain line level boards on hourly basis, carry out operations as per Operator Standard Work, conduct problem solving as per standard format and escalate issues as per ‘Standard Response to Abnormalities’. Ensure GMP (proper labeling, IPC, Line Clearance etc) and EHS (Zero Access Guarding, LOTO etc) compliance during operation. Prepare batch records of relevant operations. Operate the machine in cost effective way ensuring right first time operation, changeovers and avoiding wastage. Ensure that the agreed preventive maintenance schedule is followed. Ensure that all the spare parts for the machine are available and stored properly. Ensure that IPC equipment and the gadgets related to the respective machine are calibrated. Identify, suggest and implement Operational Excellence (OE) projects after approval of the management.\nContact Information\nYou may apply for this position online by selecting the Apply now button.\nImportant notice to Employment businesses/ Agencies\nGSK does not accept referrals from employment businesses and/or employment agencies in respect of the vacancies posted on this site. All employment businesses/agencies are required to contact GSK's commercial and general procurement/human resources department to obtain prior written authorization before referring any candidates to GSK. The obtaining of prior written authorization is a condition precedent to any agreement (verbal or written) between the employment business/ agency and GSK. In the absence of such written authorization being obtained any actions undertaken by the employment business/agency shall be deemed to have been performed without the consent or contractual agreement of GSK. GSK shall therefore not be liable for any fees arising from such actions or any fees arising from any referrals by employment businesses/agencies in respect of the vacancies posted on this site.",
    "jobDatePosted": 1496742150000,
    "jobLocation": [
      "Karachi",
      "PK"
    ],
    "jobUrl": "https://www.linkedin.com/jobs/view/324505164",
    "jobTitle": "Production Support Officer",
    "jobProvider": "GSK",
    "jobProviderLogo": "/AAEAAQAAAAAAAANrAAAAJGM4NzMzMzRkLWRkNDEtNDFmNC1hYjg1LWJlN2U2NDVjZGVmYw.png",
    "jobId": "linkedin-324505164",
    "jobSource": "linkedin"
  },
  {
    "jobContent": "Reports To\nMaintenance Manager Summary:Reporting / Communicating Planning / Scheduling Executing / Implementing Monitoring / Analyzing Developing & Lead the Department Keeping spare parts and consumables with min- max system Responsible for maximum Plant and Equipment’s availability Performing duties as per requirements. Either 5/2, 14 / 14 or 28/28 Essential Duties & Responsibilities: Plan, Schedule, Supervise, record and perform the Plant Mechanical (static & rotary) maintenance activities, whenever required cover higher position responsibilities. Responsible to be well aware and implementation of Company guide to ethical Business conduct PRIDE Responsible to be well aware and implementation of emergency plan, Company HSE policy and his role & PTW (permit to work) system. Ensures compliance of international standards, engineering practices, quality procedures and OEM instructions. Responsible for maximum plant availability, equipment’s reliability, cost effective maintenance, inventory transactions, Accpac data feedings, Monthly reports, maintenance schedule, duty roster and act as a bridge between management and work force. Responsible for all team members to be well aware of all plant equipment, Instrument, skid and plant facility Responsible for Recording, marinating and updating of the running machines parameters on reading sheets with proper intervals, daily mechanical activity reports in hard copies as well as in soft copies too. Responsible for planning, scheduling and execution of all Preventive/schedule, Predictive and corrective maintenance as per OEM instructions and procedures. Responsible for monitoring, Analyzing and finds correct reason of machine failures/tripping through equipment history, fault history & OEM instructions Responsible for monitoring closely abnormal behaviors & sounds of running machines and take necessary corrective actions. Responsible for rebuild & repair all item in workshop with high standard craftsman ship. Responsible for enhancing the skills of mechanical crew through discussion, debates, presentations and training.\n",
    "jobDatePosted": 1496742363000,
    "jobLocation": [
      "Gilgit",
      "PK"
    ],
    "jobUrl": "https://www.linkedin.com/jobs/view/324504477",
    "jobTitle": "Mechanical Supervisor",
    "jobProvider": "Exterran",
    "jobProviderLogo": "/p/5/000/1da/10f/1134604.png",
    "jobId": "linkedin-324504477",
    "jobSource": "linkedin"
  },
  {
    "jobContent": "Ensure achievement of agreed targets/KPIs for the assigned Area.\nDevelop and Implement field Sales Plan for the assigned area.\nEffectively manage distributor/customers and their operations.\nResponsible for the execution of the Channel Category plans at the POP/Outlets as per the channel and category prioritization.\nResponsible to provide quality and on-time information.\n2-3 years in marketing or sales, and over this period has successfully delivered on KPIs.\n Demonstrated ability to lead and develop himself & teams Capacity to understands all sales functions i.e. CCSD, Customer, Field Had experience in managing field Sales team\nPrimary Location\nPakistan\nJob\nSales\nOrganization\nNestle Pakistan Ltd.\nSchedule\nFull-time\nJob Posting\nJun 5, 2017, 105234 AM",
    "jobDatePosted": 1496738358000,
    "jobLocation": [
      "IslamicRepublicofPakistan",
      "PK"
    ],
    "jobUrl": "https://www.linkedin.com/jobs/view/305672374",
    "jobTitle": "Area Sales Manager-Sargodha",
    "jobProvider": "Nestlé",
    "jobProviderLogo": "/AAEAAQAAAAAAAAzLAAAAJGUxMTA5OWI5LWM1ZjMtNGI4Zi04ODdkLTlkYzg3NDk3NGMxZg.png",
    "jobId": "linkedin-305672374",
    "jobSource": "linkedin"
  },
  {
    "jobContent": "Description\nPosition description Fresh or 1-2years experienced Mechanical Engineering Graduates\n Requirements  Mechanical Engineering Knowledge B.Sc Mechanical Engineering Fresh or 1-2years experience\n Contact person to give further information  Tahir Kalam\ntahir.kalam@wartsila.com\nService Coordinator\n Country  Pakistan\n Job area  Service Delivery",
    "jobDatePosted": 1496734085000,
    "jobLocation": [
      "Karachi",
      "PK"
    ],
    "jobUrl": "https://www.linkedin.com/jobs/view/361775161",
    "jobTitle": "Trainee Engineer Mechanical",
    "jobProvider": "Wärtsilä",
    "jobProviderLogo": "/AAEAAQAAAAAAAAl1AAAAJGY1ZWU5ZWI1LWFmNjEtNGE5MC1iZmZlLThhMGZjMTEyMjY3Mw.png",
    "jobId": "linkedin-361775161",
    "jobSource": "linkedin"
  },
  {
    "jobContent": "Position description  Perform repairs and overhauls on equipment components according to given instructions as well as quality, health, safety and environmental and cost targets.\nExecuting planned maintenances and repairing jobs on Wärtsilä OEM engines and its auxiliaries according to Wärtsilä instructions.\nProviding support for Service Engineers at maintenance works on other Wärtsilä OEM engines.\nFulfill tasks given by the FS Team Leader\nRequirements\nRequirements User level computer skills(MS Office)\nWillingness to travel\nAbility to deal with people\nAvailability to work flexible schedule including weekends and nights\nEducation: Technical vocational school degree, preferably diesel technology (Marine, Mechanical)or engine specific practical training\nExperience: 3-5 Years of Wartsila Engine / power plant Experience\n Contact person to give further information  Tahir Kalam\ntahir.kalam@wartsila.com\nService Coordinator\n Country  Pakistan\n Job area  Service Delivery",
    "jobDatePosted": 1496734077000,
    "jobLocation": [
      "Karachi",
      "PK"
    ],
    "jobUrl": "https://www.linkedin.com/jobs/view/361774477",
    "jobTitle": "Service Mechanic Mechanical",
    "jobProvider": "Wärtsilä",
    "jobProviderLogo": "/AAEAAQAAAAAAAAl1AAAAJGY1ZWU5ZWI1LWFmNjEtNGE5MC1iZmZlLThhMGZjMTEyMjY3Mw.png",
    "jobId": "linkedin-361774477",
    "jobSource": "linkedin"
  },
  {
    "jobContent": "Position description  Capable of performing & leading major overhauls of Wartsila Power Plant.\nResponsibilities\nResponsibilities Team Leading skills of highly trained people\nShould have very good customer relationship skills.\nExcellent Hands on skills for Wartsila HFO, duel fuel and gas engines.\nShould carry out major and minor troubleshooting & modification work.\nRequirements\nEducation: B.SC Mechanical Engineering / B Tech / Marine Engineering\nExperience: 5-7 Years of Wartsila Engine Experience.\n Contact person to give further information  Tahir Kalam\ntahir.kalam@wartsila.com\nService Coordinator\n Country  Pakistan\n Job area  Service Delivery",
    "jobDatePosted": 1496734077000,
    "jobLocation": [
      "Karachi",
      "PK"
    ],
    "jobUrl": "https://www.linkedin.com/jobs/view/361776006",
    "jobTitle": "Senior Service Engineer Mechanical",
    "jobProvider": "Wärtsilä",
    "jobProviderLogo": "/AAEAAQAAAAAAAAl1AAAAJGY1ZWU5ZWI1LWFmNjEtNGE5MC1iZmZlLThhMGZjMTEyMjY3Mw.png",
    "jobId": "linkedin-361776006",
    "jobSource": "linkedin"
  },
  {
    "jobContent": "Location: Lahore, Pakistan Minimum Qualification: At least a Bachelors (Preferably Masters) Minimum Experience: 6-9 Years (at least 3 years of exposure to Distribution Development and Sales Management in the Food Production industry preferably in the Snacks segment)\n Manage the day-to-day activities of a regional sales force in order to implement the organisation’s overall sales strategy for an assigned region. Monitor the performance of the sales teams or branches within the region and re-allocate resources to improve overall results. Contribute to the development of sales, marketing, customer retention, advertising, pricing, distributor and distribution strategies for the region. Oversee sales support activities such as sales administration, customer service, distribution, invoicing, and credit and collections to ensure that customer orders are processed, dispatched, invoiced, and paid accurately and on time. Coach sales representatives on the technical aspects of the organisation’s products and services; on marketing campaigns and sales promotions; and on sales techniques, procedures, and standards that will help them achieve their sales targets.",
    "jobDatePosted": 1496726040000,
    "jobLocation": [
      "Lahore",
      "Pakistan"
    ],
    "jobUrl": "https://www.linkedin.com/jobs/view/305669152",
    "jobTitle": "Regional Sales Manager",
    "jobProvider": "National Foods Limited",
    "jobProviderLogo": "/p/2/000/043/0e1/1f1620f.png",
    "jobId": "linkedin-305669152",
    "jobSource": "linkedin"
  },
  {
    "jobContent": "Virtelligence is seeking Digital Marketer/ Demand Gen/ Content/ Proposal Writer to join our team. This position has dual role. Proposal Writer and Digital Marketer. \n You will be responsible for researching, writing and producing Proposal  responses to Virtelligence aggressive growth objectives in the IT Consulting Markets.  We are seeking experienced and passionate web savvy professional that can apply their technical skills and knowledge of Content writing, Digital Marketing and proposal writing in a fast paced environment. The successful candidate will manage the RFP process for the company; verifying all RFPs received by the company are tracked, read, disseminated to appropriate audiences, compiled, and sent out.  Proposal Writer will craft highly compelling content that describes value proposition, market positioning, and competitive advantages while meeting stringent deadlines.  The individual must be extremely detail-oriented, and strive for zero-tolerance in meeting quality objectives and deadlines.  \n Partners with subject matter experts (SMEs) including: sales, marketing, product management, operations, legal and finance to develop quality and winning responses\n Creates process flowcharts, illustrations, pricing grids, organization charts and PPT-based content summaries\n Develops and manages content library in collaboration with SMEs to ensure database is complete with current proposal responses, attachments, charts and illustrations\n Responsible for research, storage, summarizing and communicating competitive industry information and proposal response information when available\n Responsible for related proposal and marketing communications projects as assigned\n Meets proposal and agreement deadlines by establishing priorities and target dates for information gathering, writing, review, and approval; entering and monitoring tracking data; coordinating requirements with contributors; contributing proposal status information; transmitting proposals\n Improves proposal writing results by evaluating and re-designing processes, approach, coordination, and boilerplate; implementing changes\n Develop online marketing and website content, manage ongoing updates including copywriting  and social media write up\n Managing analysis, optimization and ad-hoc reporting using Google Analytics\n Applying and maintaining quality assurance standards for copy and media management\n Implementing content updates across public and internal web sites\n Providing basic training for new content contributors\n Keeping track of the latest trends in content management and web project management by attending trainings and webinars, and communicating with our vendors\n Review and provide marketing material for firm company brochures and case studies.\n Productizing resumes/ resume format, developing compelling marketing templates for resumes and proposals\n Sales support, proposal assistance, sales material readiness and marketing\n Content Development - Create and edit content, ad copy, newsletter articles, promotional text and creative concepts for marketing deliverables. Produce product and promotional copy for original ads, promotions and other marketing initiatives.\n Writing press releases and managing postings to press release syndication sites.\n Schedules meetings and send out communications\n Conduct planning sessions with group leads to fully analyze business opportunities (Requests for Proposals) and determine how to best position the proposal response.\n Author, edit, and approve content in a proposal response to ensure consistency, clarity, appropriateness, and persuasiveness of material.\n Coordinate and gather information needed to finalize business proposals, such as project objectives and requirements, key assumptions, pricing details and estimate\n Ensure that proposal responses are compelling, well-written, accurate, and in full compliance with the requeste\n Responsible for maintaining and updating company website content, Author and edit offline media such as product sheets, brochures, articles etc.\n Manage digital image library and provide graphics support\n Assist in design, development and implementation of electronic marketing initiatives including landing pages, banner ads, on-line surveys, HTML emails, newsletters etc.\n Experience with Hubspote or other marketing products helpful.\n Communicate with management and outside vendors, maintaining strong relationships.\n Coordinate exhibits/ tradeshow arrangements and other electronically-based marketing initiatives as needed.\n Perform other related duties as assigned.",
    "jobDatePosted": 1496709504000,
    "jobLocation": [
      "IslamabadGpo",
      "FederalCapial&AJK",
      "Pakistan"
    ],
    "jobUrl": "https://www.linkedin.com/jobs/view/305668376",
    "jobTitle": "Digital Marketing/ Demand Generation/ Proposal Writing/ Deal Pursuit",
    "jobProvider": "Virtelligence",
    "jobProviderLogo": "/AAEAAQAAAAAAAAfOAAAAJDdlOGUyMTFhLTkwZjYtNDYwZS1iZTE3LWM3NmEwZTA0MDc4ZQ.png",
    "jobId": "linkedin-305668376",
    "jobSource": "linkedin"
  }
]